kLabUM/evaporation/WindSensor/airmartest.cydsn/Generated_Source/PSoC5/psoc_MASTER.c
/*******************************************************************************
* File Name: psoc_MASTER.c
* Version 3.30
*
* Description:
*  This file provides the source code of APIs for the I2C component Master mode.
*
* Note:
*
*******************************************************************************
* Copyright 2012, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "psoc_PVT.h"

#if(psoc_MODE_MASTER_ENABLED)

/**********************************
*      System variables
**********************************/

volatile uint8 psoc_mstrStatus;     /* Master Status byte  */
volatile uint8 psoc_mstrControl;    /* Master Control byte */

/* Transmit buffer variables */
volatile uint8 * psoc_mstrRdBufPtr;     /* Pointer to Master Read buffer */
volatile uint8   psoc_mstrRdBufSize;    /* Master Read buffer size       */
volatile uint8   psoc_mstrRdBufIndex;   /* Master Read buffer Index      */

/* Receive buffer variables */
volatile uint8 * psoc_mstrWrBufPtr;     /* Pointer to Master Write buffer */
volatile uint8   psoc_mstrWrBufSize;    /* Master Write buffer size       */
volatile uint8   psoc_mstrWrBufIndex;   /* Master Write buffer Index      */


/*******************************************************************************
* Function Name: psoc_MasterWriteBuf
********************************************************************************
*
* Summary:
*  Automatically writes an entire buffer of data to a slave device. Once the
*  data transfer is initiated by this function, further data transfer is handled
*  by the included ISR in byte by byte mode.
*
* Parameters:
*  slaveAddr: 7-bit slave address.
*  xferData:  Pointer to buffer of data to be sent.
*  cnt:       Size of buffer to send.
*  mode:      Transfer mode defines: start or restart condition generation at
*             begin of the transfer and complete the transfer or halt before
*             generating a stop.
*
* Return:
*  Status error - zero means no errors.
*
* Side Effects:
*  The included ISR will start transfer after start or restart condition will
*  be generated.
*
* Global variables:
*  psoc_mstrStatus  - used to store current status of I2C Master.
*  psoc_state       - used to store current state of software FSM.
*  psoc_mstrControl - used to control master end of transaction with
*  or without the Stop generation.
*  psoc_mstrWrBufPtr - used to store pointer to master write buffer.
*  psoc_mstrWrBufIndex - used to current index within master write
*  buffer.
*  psoc_mstrWrBufSize - used to store master write buffer size.
*
* Reentrant:
*  No
*
*******************************************************************************/
uint8 psoc_MasterWriteBuf(uint8 slaveAddress, uint8 * wrData, uint8 cnt, uint8 mode)
      
{
    uint8 errStatus;

    errStatus = psoc_MSTR_NOT_READY;

    if(NULL != wrData)
    {
        /* Check I2C state before transfer: valid are IDLE or HALT */
        if(psoc_SM_IDLE == psoc_state)
        {
            /* Check if free: Master is ready to transaction */
            if(psoc_CHECK_BUS_FREE(psoc_MCSR_REG))
            {
                errStatus = psoc_MSTR_NO_ERROR;
            }
            else
            {
                errStatus = psoc_MSTR_BUS_BUSY;
            }
        }
        else if(psoc_SM_MSTR_HALT == psoc_state)
        {
            errStatus = psoc_MSTR_NO_ERROR;

            CyIntClearPending(psoc_ISR_NUMBER);
            psoc_mstrStatus &= ((uint8) ~psoc_MSTAT_XFER_HALT);
        }
        else
        {
            /* errStatus = psoc_MSTR_NOT_READY was send before */
        }

        if(psoc_MSTR_NO_ERROR == errStatus)
        {
            psoc_state    = psoc_SM_MSTR_WR_ADDR;
            psoc_DATA_REG = ((uint8) (slaveAddress << psoc_SLAVE_ADDR_SHIFT));

            psoc_mstrWrBufIndex = 0u;
            psoc_mstrWrBufSize  = cnt;
            psoc_mstrWrBufPtr   = (volatile uint8 *) wrData;

            psoc_mstrControl = mode;    /* Save transaction mode */

            /* Generate a Start or ReStart depends on mode */
            if(psoc_CHECK_RESTART(mode))
            {
                psoc_GENERATE_RESTART;
            }
            else
            {
                psoc_GENERATE_START;
            }

            psoc_mstrStatus &= ((uint8) ~psoc_MSTAT_WR_CMPLT);

            psoc_EnableInt();   /* Enable intr to complete transfer */
        }
    }

    return(errStatus);
}


/*******************************************************************************
* Function Name: psoc_MasterReadBuf
********************************************************************************
*
* Summary:
*  Automatically writes an entire buffer of data to a slave device. Once the
*  data transfer is initiated by this function, further data transfer is handled
*  by the included ISR in byte by byte mode.
*
* Parameters:
*  slaveAddr: 7-bit slave address.
*  xferData:  Pointer to buffer where to put data from slave.
*  cnt:       Size of buffer to read.
*  mode:      Transfer mode defines: start or restart condition generation at
*             begin of the transfer and complete the transfer or halt before
*             generating a stop.
*
* Return:
*  Status error - zero means no errors.
*
* Side Effects:
*  The included ISR will start transfer after start or restart condition will
*  be generated.
*
* Global variables:
*  psoc_mstrStatus  - used to store current status of I2C Master.
*  psoc_state       - used to store current state of software FSM.
*  psoc_mstrControl - used to control master end of transaction with
*  or without the Stop generation.
*  psoc_mstrRdBufPtr - used to store pointer to master write buffer.
*  psoc_mstrRdBufIndex - used to current index within master write
*  buffer.
*  psoc_mstrRdBufSize - used to store master write buffer size.
*
* Reentrant:
*  No
*
*******************************************************************************/
uint8 psoc_MasterReadBuf(uint8 slaveAddress, uint8 * rdData, uint8 cnt, uint8 mode)
      
{
    uint8 errStatus;

    errStatus = psoc_MSTR_NOT_READY;

