kLabUM/evaporation/WindSensor/airmartest.cydsn/Generated_Source/PSoC5/psoc_MASTER.c
    if(NULL != rdData)
    {
        /* Check I2C state before transfer: valid are IDLE or HALT */
        if(psoc_SM_IDLE == psoc_state)
        {
            /* Check if free: Master is ready to transaction */
            if(psoc_CHECK_BUS_FREE(psoc_MCSR_REG))
            {
                errStatus = psoc_MSTR_NO_ERROR;
            }
            else
            {
                errStatus = psoc_MSTR_BUS_BUSY;
            }
        }
        else if(psoc_SM_MSTR_HALT == psoc_state)
        {
            errStatus = psoc_MSTR_NO_ERROR;

            CyIntClearPending(psoc_ISR_NUMBER);
            psoc_mstrStatus &= ((uint8) ~psoc_MSTAT_XFER_HALT);
        }
        else
        {
            /* errStatus = psoc_MSTR_NOT_READY was send before */
        }

        if(psoc_MSTR_NO_ERROR == errStatus)
        {
            psoc_state    = psoc_SM_MSTR_RD_ADDR;
            psoc_DATA_REG = (((uint8) (slaveAddress << psoc_SLAVE_ADDR_SHIFT)) |
                                                   psoc_READ_FLAG);

            psoc_mstrRdBufIndex  = 0u;
            psoc_mstrRdBufSize   = cnt;
            psoc_mstrRdBufPtr    = (volatile uint8 *) rdData;

            psoc_mstrControl = mode;    /* Save transaction mode */

            /* Generate a Start or ReStart depends on mode */
            if(psoc_CHECK_RESTART(mode))
            {
                psoc_GENERATE_RESTART;
            }
            else
            {
                psoc_GENERATE_START;
            }

            psoc_mstrStatus &= ((uint8) ~psoc_MSTAT_RD_CMPLT);

            psoc_EnableInt();   /* Enable intr to complete transfer */
        }
    }

    return(errStatus);
}


/*******************************************************************************
* Function Name: psoc_MasterSendStart
********************************************************************************
*
* Summary:
*  Generates Start condition and sends slave address with read/write bit.
*
* Parameters:
*  slaveAddress:  7-bit slave address.
*  R_nW:          Zero, send write command, non-zero send read command.
*
* Return:
*  Status error - zero means no errors.
*
* Side Effects:
*  This function is entered without a 'byte complete' bit set in the I2C_CSR
*  register. It does not exit until it will be set.
*
* Global variables:
*  psoc_state - used to store current state of software FSM.
*
* Reentrant:
*  No
*
*******************************************************************************/
uint8 psoc_MasterSendStart(uint8 slaveAddress, uint8 R_nW)
      
{
    uint8 errStatus;

    errStatus = psoc_MSTR_NOT_READY;

    /* If IDLE, check if bus is free */
    if(psoc_SM_IDLE == psoc_state)
    {
        /* If bus is free, generate Start condition */
        if(psoc_CHECK_BUS_FREE(psoc_MCSR_REG))
        {
            psoc_DisableInt();  /* Disable ISR for Manual functions */

            slaveAddress = ((uint8) (slaveAddress << psoc_SLAVE_ADDR_SHIFT)); /* Set Address */
            if(0u != R_nW)                                      /* Set the Read/Write flag */
            {
                slaveAddress |= psoc_READ_FLAG;
                psoc_state = psoc_SM_MSTR_RD_ADDR;
            }
            else
            {
                psoc_state = psoc_SM_MSTR_WR_ADDR;
            }
            psoc_DATA_REG = slaveAddress;   /* Write address to data reg */


            psoc_GENERATE_START;
            while(psoc_WAIT_BYTE_COMPLETE(psoc_CSR_REG))
            {
                ; /* Wait for the address to be transfered */
            }

            #if(psoc_MODE_MULTI_MASTER_SLAVE_ENABLED)
                if(psoc_CHECK_START_GEN(psoc_MCSR_REG))
                {
                    psoc_CLEAR_START_GEN;

                    /* Start condition was not generated: reset FSM to IDLE */
                    psoc_state = psoc_SM_IDLE;
                    errStatus = psoc_MSTR_ERR_ABORT_START_GEN;
                }
                else
            #endif /* (psoc_MODE_MULTI_MASTER_SLAVE_ENABLED) */

            #if(psoc_MODE_MULTI_MASTER_ENABLED)

                if(psoc_CHECK_LOST_ARB(psoc_CSR_REG))
                {
                    psoc_BUS_RELEASE;

                    /* Master lost arbitrage: reset FSM to IDLE */
                    psoc_state = psoc_SM_IDLE;
                    errStatus = psoc_MSTR_ERR_ARB_LOST;
                }
                else
            #endif /* (psoc_MODE_MULTI_MASTER_ENABLED) */

                if(psoc_CHECK_ADDR_NAK(psoc_CSR_REG))
                {
                    /* Address has been NACKed: reset FSM to IDLE */
                    psoc_state = psoc_SM_IDLE;
                    errStatus = psoc_MSTR_ERR_LB_NAK;
                }
                else
                {
                    /* Start was sent witout errors */
                    errStatus = psoc_MSTR_NO_ERROR;
                }
        }
        else
        {
            errStatus = psoc_MSTR_BUS_BUSY; /* Bus is busy */
        }
    }

    return(errStatus);
}


/*******************************************************************************
* Function Name: psoc_MasterSendRestart
********************************************************************************
*
* Summary:
*  Generates ReStart condition and sends slave address with read/write bit.
*
* Parameters:
*  slaveAddress:  7-bit slave address.
*  R_nW:          Zero, send write command, non-zero send read command.
*
* Return:
*  Status error - zero means no errors.
*
* Side Effects:
*  This function is entered without a 'byte complete' bit set in the I2C_CSR
*  register. It does not exit until it will be set.
*
* Global variables:
*  psoc_state - used to store current state of software FSM.
*
* Reentrant:
*  No
*
*******************************************************************************/
uint8 psoc_MasterSendRestart(uint8 slaveAddress, uint8 R_nW)
      
{
    uint8 errStatus;

    errStatus = psoc_MSTR_NOT_READY;

    /* Check if START condition was generated */
    if(psoc_CHECK_MASTER_MODE(psoc_MCSR_REG))
    {
        slaveAddress = ((uint8) (slaveAddress << psoc_SLAVE_ADDR_SHIFT)); /* Set Address */
        if(0u != R_nW)  /* Set the Read/Write flag */
        {
            slaveAddress |= psoc_READ_FLAG;
            psoc_state = psoc_SM_MSTR_RD_ADDR;
        }
        else
        {
            psoc_state = psoc_SM_MSTR_WR_ADDR;
        }
        psoc_DATA_REG = slaveAddress;    /* Write address to data reg */


        psoc_GENERATE_RESTART_MANUAL;
        while(psoc_WAIT_BYTE_COMPLETE(psoc_CSR_REG))
        {
            ; /* Wait for the address to be transfered */
        }

        #if(psoc_MODE_MULTI_MASTER_ENABLED)
            if(psoc_CHECK_LOST_ARB(psoc_CSR_REG))
            {
                psoc_BUS_RELEASE;

                /* Master lost arbitrage: reset FSM to IDLE */
                psoc_state = psoc_SM_IDLE;
                errStatus = psoc_MSTR_ERR_ARB_LOST;
            }
            else
        #endif /* (psoc_MODE_MULTI_MASTER_ENABLED) */

            if(psoc_CHECK_ADDR_NAK(psoc_CSR_REG))
            {
                /* Address has been NACKed: reset FSM to IDLE */
                psoc_state = psoc_SM_IDLE;
                errStatus = psoc_MSTR_ERR_LB_NAK;
            }
            else
            {
                /* ReStart was sent witout errors */
                errStatus = psoc_MSTR_NO_ERROR;
            }
    }

