kLabUM/evaporation/WindSensor/airmartest.cydsn/Generated_Source/PSoC5/psoc_MASTER.c
    return(errStatus);
}


/*******************************************************************************
* Function Name: psoc_MasterSendStop
********************************************************************************
*
* Summary:
*  Generates I2C Stop condition on bus. Function do nothing if Start or Restart
*  condition was failed before call this function.
*
* Parameters:
*  None
*
* Return:
*  Status error - zero means no errors.
*
* Side Effects:
*  The Stop generation is required to complete transaction.
*  This function does not wait whileStop condition will be generated.
*
* Global variables:
*  psoc_state - used to store current state of software FSM.
*
* Reentrant:
*  No
*
*******************************************************************************/
uint8 psoc_MasterSendStop(void) 
{
    uint8 errStatus;

    errStatus = psoc_MSTR_NOT_READY;

    /* Check if START condition was generated */
    if(psoc_CHECK_MASTER_MODE(psoc_MCSR_REG))
    {
        psoc_GENERATE_STOP_MANUAL;              /* Generate STOP */
        psoc_state = psoc_SM_IDLE;  /* Reset state to IDLE */

        while(psoc_WAIT_STOP_COMPLETE(psoc_CSR_REG))
        {
            ; /* Wait for Stop to be generated */
        }

        errStatus = psoc_MSTR_NO_ERROR;
        #if(psoc_MODE_MULTI_MASTER_ENABLED)
            if(psoc_CHECK_LOST_ARB(psoc_CSR_REG))
            {
                psoc_BUS_RELEASE;

                /* NACK was generated by enother instead Stop */
                errStatus = psoc_MSTR_ERR_ARB_LOST;
            }
        #endif /* (psoc_MODE_MULTI_MASTER_ENABLED) */
    }

    return(errStatus);
}


/*******************************************************************************
* Function Name: psoc_MasterWriteByte
********************************************************************************
*
* Summary:
*  Sends one byte to a slave. A valid Start or ReStart condition must be
*  generated before this call this function. Function do nothing if Start or
*  Restart condition was failed before call this function.
*
* Parameters:
*  data:  The data byte to send to the slave.
*
* Return:
*  Status error - zero means no errors.
*
* Side Effects:
*  This function is entered without a 'byte complete' bit set in the I2C_CSR
*  register. It does not exit until it will be set.
*
* Global variables:
*  psoc_state - used to store current state of software FSM.
*
*******************************************************************************/
uint8 psoc_MasterWriteByte(uint8 theByte) 
{
    uint8 errStatus;

    errStatus = psoc_MSTR_NOT_READY;

    /* Check if START condition was generated */
    if(psoc_CHECK_MASTER_MODE(psoc_MCSR_REG))
    {
        psoc_DATA_REG = theByte;                        /* Write DATA register */
        psoc_TRANSMIT_DATA_MANUAL;                      /* Set transmit mode */
        psoc_state = psoc_SM_MSTR_WR_DATA;  /* Set state WR_DATA */

        /* Make sure the last byte has been transfered first */
        while(psoc_WAIT_BYTE_COMPLETE(psoc_CSR_REG))
        {
            ; /* Wait for byte to be written */
        }

        #if(psoc_MODE_MULTI_MASTER_ENABLED)
            if(psoc_CHECK_LOST_ARB(psoc_CSR_REG))
            {
                psoc_BUS_RELEASE;

                /* Master lost arbitrage: reset FSM to IDLE */
                psoc_state = psoc_SM_IDLE;
                errStatus = psoc_MSTR_ERR_ARB_LOST;
            }
            /* Check LRB bit */
            else
        #endif /* (psoc_MODE_MULTI_MASTER_ENABLED) */

            if(psoc_CHECK_DATA_ACK(psoc_CSR_REG))
            {
                psoc_state = psoc_SM_MSTR_HALT;     /* Set state to HALT */
                errStatus = psoc_MSTR_NO_ERROR;                 /* The LRB was ACKed */
            }
            else
            {
                psoc_state = psoc_SM_MSTR_HALT;     /* Set state to HALT */
                errStatus = psoc_MSTR_ERR_LB_NAK;               /* The LRB was NACKed */
            }
    }

    return(errStatus);
}


/*******************************************************************************
* Function Name: psoc_MasterReadByte
********************************************************************************
*
* Summary:
*  Reads one byte from a slave and ACK or NACK the transfer. A valid Start or
*  ReStart condition must be generated before this call this function. Function
*  do nothing if Start or Restart condition was failed before call this
*  function.
*
* Parameters:
*  acknNack:  Zero, response with NACK, if non-zero response with ACK.
*
* Return:
*  Byte read from slave.
*
* Side Effects:
*  This function is entered without a 'byte complete' bit set in the I2C_CSR
*  register. It does not exit until it will be set.
*
* Global variables:
*  psoc_state - used to store current state of software FSM.
*
* Reentrant:
*  No
*
*******************************************************************************/
uint8 psoc_MasterReadByte(uint8 acknNak) 
{
    uint8 theByte;

    theByte = 0u;

    /* Check if START condition was generated */
    if(psoc_CHECK_MASTER_MODE(psoc_MCSR_REG))
    {
        /* When address phase need release the bus and receive the byte, then decide ACK or NACK */
        if(psoc_SM_MSTR_RD_ADDR == psoc_state)
        {
            psoc_state = psoc_SM_MSTR_RD_DATA;
            psoc_READY_TO_READ_MANUAL;
        }

        while(psoc_WAIT_BYTE_COMPLETE(psoc_CSR_REG))
        {
            ; /* Wait for byte to be read */
        }

        theByte = psoc_DATA_REG;

        /* Now if the ACK flag was set, ACK the data which will release the bus and
           start the next byte in otherwise do NOTHING to the CSR reg.
           This will allow the calling routine to generate a repeat start or
           stop depending on it's preference. */
        if(acknNak != 0u)   /* Do ACK */
        {
            psoc_ACK_AND_RECEIVE_MANUAL;
        }
        else                /* Do NACK */
        {
            /* Do nothing to be able work with ReStart */
            psoc_state = psoc_SM_MSTR_HALT;
        }
    }

