kLabUM/evaporation/WindSensor/airmartest.cydsn/Generated_Source/PSoC5/psoc_MASTER.c
    return(theByte);
}


/*******************************************************************************
* Function Name: psoc_MasterStatus
********************************************************************************
*
* Summary:
*  Returns the master's communication status.
*
* Parameters:
*  None
*
* Return:
*  Current status of I2C master.
*
* Global variables:
*  psoc_mstrStatus - used to store current status of I2C Master.
*
*******************************************************************************/
uint8 psoc_MasterStatus(void) 
{
    uint8 status;

    status = psoc_mstrStatus;

    /* When in Master state only transaction is in progress */
    if(psoc_CHECK_SM_MASTER)
    {
        /* Add transaction in progress activity to master status */
        status |= psoc_MSTAT_XFER_INP;
    }
    else
    {
        /* Current master status is valid */
    }

    return(status);
}


/*******************************************************************************
* Function Name: psoc_MasterClearStatus
********************************************************************************
*
* Summary:
*  Clears all status flags and returns the master status.
*
* Parameters:
*  None
*
* Return:
*  Current status of I2C master.
*
* Global variables:
*  psoc_mstrStatus - used to store current status of I2C Master.
*
* Reentrant:
*  No
*
*******************************************************************************/
uint8 psoc_MasterClearStatus(void) 
{
    /* Current master status */
    uint8 status;

    /* Read and clear master status */
    status = psoc_mstrStatus;
    psoc_mstrStatus = psoc_MSTAT_CLEAR;

    return(status);
}


/*******************************************************************************
* Function Name: psoc_MasterGetReadBufSize
********************************************************************************
*
* Summary:
*  Returns the amount of bytes that has been transferred with an
*  I2C_MasterReadBuf command.
*
* Parameters:
*  None
*
* Return:
*  Byte count of transfer. If the transfer is not yet complete, it will return
*  the byte count transferred so far.
*
* Global variables:
*  psoc_mstrRdBufIndex - used to current index within master read
*  buffer.
*
*******************************************************************************/
uint8 psoc_MasterGetReadBufSize(void) 
{
    return(psoc_mstrRdBufIndex);
}


/*******************************************************************************
* Function Name: psoc_MasterGetWriteBufSize
********************************************************************************
*
* Summary:
*  Returns the amount of bytes that has been transferred with an
*  I2C_MasterWriteBuf command.
*
* Parameters:
*  None
*
* Return:
*  Byte count of transfer. If the transfer is not yet complete, it will return
*  the byte count transferred so far.
*
* Global variables:
*  psoc_mstrWrBufIndex - used to current index within master write
*  buffer.
*
*******************************************************************************/
uint8 psoc_MasterGetWriteBufSize(void) 
{
    return(psoc_mstrWrBufIndex);
}


/*******************************************************************************
* Function Name: psoc_MasterClearReadBuf
********************************************************************************
*
* Summary:
*  Resets the read buffer pointer back to the first byte in the buffer.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  psoc_mstrRdBufIndex - used to current index within master read
*   buffer.
*  psoc_mstrStatus - used to store current status of I2C Master.
*
* Reentrant:
*  No
*
*******************************************************************************/
void psoc_MasterClearReadBuf(void) 
{
    psoc_mstrRdBufIndex = 0u;
    psoc_mstrStatus    &= ((uint8) ~psoc_MSTAT_RD_CMPLT);
}


/*******************************************************************************
* Function Name: psoc_MasterClearWriteBuf
********************************************************************************
*
* Summary:
*  Resets the write buffer pointer back to the first byte in the buffer.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  psoc_mstrRdBufIndex - used to current index within master read
*   buffer.
*  psoc_mstrStatus - used to store current status of I2C Master.
*
* Reentrant:
*  No
*
*******************************************************************************/
void psoc_MasterClearWriteBuf(void) 
{
    psoc_mstrWrBufIndex = 0u;
    psoc_mstrStatus    &= ((uint8) ~psoc_MSTAT_WR_CMPLT);
}


/*******************************************************************************
* Function Name: psoc_Workaround
********************************************************************************
*
* Summary:
*  Do nothing. This fake fuction use as workaround for CDT 78083.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Reentrant:
*  No
*
*******************************************************************************/
void psoc_Workaround(void) 
{
    /* Does nothing */
}

#endif /* (psoc_MODE_MASTER_ENABLED) */


/* [] END OF FILE */
